{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.3.1", "modelTopology": {"node": [{"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "layer_1/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediciton/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/W"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "layer_1/add", "op": "AddV2", "input": ["layer_1/B", "layer_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Shape", "op": "Shape", "input": ["layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "26"}, "seed": {"i": "404"}}}, {"name": "dropout_layer/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_layer/random_uniform/RandomUniform", "dropout_layer/rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Cast", "op": "Cast", "input": ["dropout_layer/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/mul", "op": "Mul", "input": ["dropout_layer/Cast", "dropout_layer/truediv"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/mul_1", "op": "Mul", "input": ["dropout_layer/mul", "layer_1/Relu"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["dropout_layer/mul_1", "layer_2/W"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "layer_2/add", "op": "AddV2", "input": ["layer_2/B", "layer_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "out/W"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "out/add", "op": "AddV2", "input": ["out/B", "out/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediciton", "op": "ArgMax", "input": ["out/Softmax", "accuracy_calc/prediciton/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}]}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "layer_1/W", "shape": [784, 512], "dtype": "float32"}, {"name": "out/B", "shape": [10], "dtype": "float32"}, {"name": "layer_1/B", "shape": [512], "dtype": "float32"}, {"name": "dropout_layer/rate", "shape": [], "dtype": "float32"}, {"name": "dropout_layer/truediv", "shape": [], "dtype": "float32"}, {"name": "layer_2/W", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_2/B", "shape": [64], "dtype": "float32"}, {"name": "out/W", "shape": [64, 10], "dtype": "float32"}, {"name": "accuracy_calc/prediciton/dimension", "shape": [], "dtype": "int32"}]}]}